AriaSignature-Cfe/DataProcessors/АС_МониторAria.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>АС_МониторAria</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АС_КонтрагентыAria</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Компьютер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АС_КомпьютерыAria</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Диски</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Диск</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Здоровье</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объем</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Температура</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПоследнегоОбновленияДиски</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свободно</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Занято</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Архивации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Задача</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьКБазе</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьКАрхиву</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПоследнегоОбновленияАрхивации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыполненияЗадачи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОСистеме</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаПоследнегоОбновленияСистемы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>HostName</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОперационнаяСистема</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОЗУ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IPАдреса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Процессор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Видеокарта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

AriaSignature-Cfe/InformationRegisters/АС_НастройкиПрограммы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>АС_НастройкиПрограммы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПортMelezh</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АС_КонтрагентыAria</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AriaSignature-Cfe/Catalogs/АС_КомпьютерыAria.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>АС_КомпьютерыAria</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяПК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентПК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АС_КонтрагентыAria</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IPУстройства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

AriaSignature-Cfe/DataProcessors/АС_МониторAria/Forms/Форма/Ext/Form/Module.bsl
//+ BAS 24.05.2026 : Melezh мониторинг, статусы и заполнение ТЧ
&НаКлиенте
Перем КэшMelezh;

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	КэшMelezh = Новый Соответствие;
	НастроитьВыборКомпьютера();
	
	Если Не ВыбраныКонтрагентИКомпьютер() Тогда
		ОчиститьДанныеМонитораНаКлиенте();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	АктуализироватьДанныеНаКлиенте(Ложь);
	Сообщить("Данные были актуализированы");
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодключение(Команда)
	АктуализироватьДанныеНаКлиенте(Истина);
	Если Объект.Статус = "Подключено" Тогда
		Сообщить("Подключение успешно установлено");
	Иначе
		Сообщить("Не удалось установить подключение. Проверьте работу службы на этом компьютере");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	Объект.Компьютер = Неопределено;
	НастроитьВыборКомпьютера();
	ОчиститьДанныеМонитораНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура КомпьютерПриИзменении(Элемент)
	Если ВыбраныКонтрагентИКомпьютер() Тогда
		АктуализироватьДанныеНаКлиенте(Ложь);
	Иначе
		ОчиститьДанныеМонитораНаКлиенте();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьКэшMelezh() Экспорт
	Возврат КэшMelezh;
КонецФункции

&НаКлиенте
Процедура АктуализироватьДанныеНаКлиенте(ТолькоПроверкаПодключения = Ложь)
	Если Не ВыбраныКонтрагентИКомпьютер() Тогда
		ОчиститьДанныеМонитораНаКлиенте();
		Возврат;
	КонецЕсли;
	
	КэшMelezh = АктуализироватьДанныеMelezhНаСервере(ТолькоПроверкаПодключения);
	ПрименитьЦветовыеИндикаторы();
КонецПроцедуры

&НаКлиенте
Функция ВыбраныКонтрагентИКомпьютер()
	Возврат ЗначениеЗаполнено(Объект.Контрагент) И ЗначениеЗаполнено(Объект.Компьютер);
КонецФункции

&НаКлиенте
Процедура НастроитьВыборКомпьютера()
	ЭлементКомпьютер = Элементы.Найти("Компьютер");
	Если ЭлементКомпьютер = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыВыбора = Новый Массив;
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		ЭлементКомпьютер.Доступность = Истина;
		ПараметрыВыбора.Добавить(Новый ПараметрВыбора("КонтрагентПК", Объект.Контрагент));
	Иначе
		ЭлементКомпьютер.Доступность = Ложь;
	КонецЕсли;
	
	ЭлементКомпьютер.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьДанныеМонитораНаКлиенте()
	Объект.Статус = "";
	Объект.Диски.Очистить();
	Объект.Архивации.Очистить();
	Объект.ОСистеме.Очистить();
	КэшMelezh = Новый Соответствие;
	СброситьЦветовыеИндикаторы();
КонецПроцедуры

&НаКлиенте
Процедура ПрименитьЦветовыеИндикаторы()
	Зеленый = WebЦвета.Зеленый;
	Красный = WebЦвета.Красный;
	Стандартный = WebЦвета.Черный;
	
	ЭлементСтатуса = Элементы.Найти("Статус");
	Если ЭлементСтатуса <> Неопределено Тогда
		Если Объект.Статус = "Подключено" Тогда
			ЭлементСтатуса.ЦветТекста = Зеленый;
		ИначеЕсли ЗначениеЗаполнено(Объект.Статус) Тогда
			ЭлементСтатуса.ЦветТекста = Красный;
		Иначе
			ЭлементСтатуса.ЦветТекста = Стандартный;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СброситьЦветовыеИндикаторы()
	Стандартный = WebЦвета.Черный;
	УстановитьЦветЭлемента("Статус", Стандартный, Стандартный);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЦветЭлемента(ИмяЭлемента, ЦветЭлемента, ЦветПоУмолчанию)
	ЭлементФормы = Элементы.Найти(ИмяЭлемента);
	Если ЭлементФормы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЦветЭлемента = Неопределено Тогда
		ЭлементФормы.ЦветТекста = ЦветПоУмолчанию;
	Иначе
		ЭлементФормы.ЦветТекста = ЦветЭлемента;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьПроцентСвободноИзСтроки(Свободно, Объем)
	СвободноЧисло = ПолучитьЧислоИзСтроки(Свободно);
	ОбъемЧисло = ПолучитьЧислоИзСтроки(Объем);
	Если СвободноЧисло = Неопределено ИЛИ ОбъемЧисло = Неопределено ИЛИ ОбъемЧисло <= 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат (СвободноЧисло / ОбъемЧисло) * 100;
КонецФункции

&НаКлиенте
Функция ПолучитьЧислоИзСтроки(ЗначениеСтрокой)
	Если ЗначениеСтрокой = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(ЗначениеСтрокой) = Тип("Число") Тогда
		Возврат ЗначениеСтрокой;
	КонецЕсли;
	
	Текст = СокрЛП(Строка(ЗначениеСтрокой));
	Если Не ЗначениеЗаполнено(Текст) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Текст = СтрЗаменить(Текст, " ", "");
	ВерхнийТекст = ВРег(Текст);
	Множитель = 1;
	
	Если СтрНайти(ВерхнийТекст, "ТБ") > 0 ИЛИ СтрНайти(ВерхнийТекст, "TB") > 0 ИЛИ СтрНайти(ВерхнийТекст, "TIB") > 0 Тогда
		Множитель = 1024;
	ИначеЕсли СтрНайти(ВерхнийТекст, "МБ") > 0 ИЛИ СтрНайти(ВерхнийТекст, "MB") > 0 ИЛИ СтрНайти(ВерхнийТекст, "MIB") > 0 Тогда
		Множитель = 1 / 1024;
	ИначеЕсли СтрНайти(ВерхнийТекст, "КБ") > 0 ИЛИ СтрНайти(ВерхнийТекст, "KB") > 0 ИЛИ СтрНайти(ВерхнийТекст, "KIB") > 0 Тогда
		Множитель = 1 / 1048576;
	Иначе
		Множитель = 1;
	КонецЕсли;
	
	Текст = СтрЗаменить(ВерхнийТекст, "ТБ", "");
	Текст = СтрЗаменить(Текст, "TB", "");
	Текст = СтрЗаменить(Текст, "TIB", "");
	Текст = СтрЗаменить(Текст, "ГБ", "");
	Текст = СтрЗаменить(Текст, "GB", "");
	Текст = СтрЗаменить(Текст, "GIB", "");
	Текст = СтрЗаменить(Текст, "МБ", "");
	Текст = СтрЗаменить(Текст, "MB", "");
	Текст = СтрЗаменить(Текст, "MIB", "");
	Текст = СтрЗаменить(Текст, "КБ", "");
	Текст = СтрЗаменить(Текст, "KB", "");
	Текст = СтрЗаменить(Текст, "KIB", "");
	Текст = СтрЗаменить(Текст, ",", ".");
	
	Если Не ЗначениеЗаполнено(Текст) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		Возврат Число(Текст) * Множитель;
	Исключение
		Возврат Неопределено;
	КонецПопытки;
КонецФункции

&НаСервере
Функция АктуализироватьДанныеMelezhНаСервере(Знач ТолькоПроверкаПодключения = Ложь)
	Результат = Новый Соответствие;
	Результат.Вставить("meta", Новый Соответствие);
	Результат["meta"].Вставить("loadedAt", ТекущаяДатаСеанса());
	
	Если Не ЗначениеЗаполнено(Объект.Контрагент) ИЛИ Не ЗначениеЗаполнено(Объект.Компьютер) Тогда
		Результат["meta"].Вставить("isReady", Ложь);
		Результат["meta"].Вставить("error", "Не выбран контрагент или компьютер");
		Объект.Статус = "";
		Возврат Результат;
	КонецЕсли;
	
	ПараметрыПодключения = ПолучитьПараметрыПодключенияMelezh(Объект.Контрагент, Объект.Компьютер);
	Результат["meta"].Вставить("connection", ПараметрыПодключения);
	
	Если Не ПараметрыПодключения["ok"] Тогда
		Объект.Статус = "Ошибка подключения";
		Результат["meta"].Вставить("isReady", Ложь);
		Результат["meta"].Вставить("error", ПараметрыПодключения["error"]);
		Если Не ТолькоПроверкаПодключения Тогда
			ОчиститьТабличныеЧастиНаСервере();
		КонецЕсли;
		Возврат Результат;
	КонецЕсли;
	
	БазовыйURL = ПараметрыПодключения["baseUrl"];
	Результат["meta"].Вставить("baseUrl", БазовыйURL);
	Результат["meta"].Вставить("connectionString", БазовыйURL);
	
	Результат.Вставить("ping", ВыполнитьGETMelezh(БазовыйURL + "/aria_ping"));
	Если Результат["ping"]["ok"] Тогда
		Объект.Статус = "Подключено";
	Иначе
		Объект.Статус = "Ошибка подключения";
		Результат["meta"].Вставить("isReady", Ложь);
		Результат["meta"].Вставить("error", Результат["ping"]["error"]);
		Если Не ТолькоПроверкаПодключения Тогда
			ОчиститьТабличныеЧастиНаСервере();
		КонецЕсли;
		Возврат Результат;
	КонецЕсли;
	
	Если ТолькоПроверкаПодключения Тогда
		Результат["meta"].Вставить("isReady", Истина);
		Возврат Результат;
	КонецЕсли;
	
	Результат.Вставить("status", ВыполнитьGETMelezh(БазовыйURL + "/aria_get_status"));
	Результат.Вставить("system", ВыполнитьGETMelezh(БазовыйURL + "/aria_get_system"));
	Результат.Вставить("disks", ВыполнитьGETMelezh(БазовыйURL + "/aria_get_disks"));
	Результат.Вставить("backups", ВыполнитьGETMelezh(БазовыйURL + "/aria_get_backups"));
	Результат.Вставить("backupsLogs", ВыполнитьGETMelezh(БазовыйURL + "/aria_get_backups_logs"));
	
	ДатаАктуальности = ПолучитьДатуАктуальностиИзСтатуса(Результат["status"]["data"]);
	Результат["meta"].Вставить("actualAt", ДатаАктуальности);
	
	ЗаполнитьОСистемеНаСервере(Результат["system"]["data"], ПараметрыПодключения["ip"], ДатаАктуальности);
	ЗаполнитьДискиНаСервере(Результат["disks"]["data"], ДатаАктуальности);
	ЗаполнитьАрхивацииНаСервере(Результат["backups"]["data"], Результат["backupsLogs"]["data"], ДатаАктуальности);
	
	Результат["meta"].Вставить("isReady", Истина);
	Возврат Результат;
КонецФункции

&НаСервере
Функция ПолучитьПараметрыПодключенияMelezh(Контрагент, Компьютер)
	Результат = Новый Соответствие;
	Результат.Вставить("ok", Ложь);
	Результат.Вставить("baseUrl", "");
	Результат.Вставить("error", "");
	Результат.Вставить("ip", "");
	Результат.Вставить("port", "");
	
	ЗапросПК = Новый Запрос;
	ЗапросПК.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Компьютеры.IPУстройства КАК IPУстройства,
	|	Компьютеры.КонтрагентПК КАК КонтрагентПК
	|ИЗ
	|	Справочник.АС_КомпьютерыAria КАК Компьютеры
	|ГДЕ
	|	Компьютеры.Ссылка = &Компьютер";
	
	ЗапросПК.УстановитьПараметр("Компьютер", Компьютер);
	ВыборкаПК = ЗапросПК.Выполнить().Выбрать();
	Если Не ВыборкаПК.Следующий() Тогда
		Результат["error"] = "Не найден выбранный компьютер";
		Возврат Результат;
	КонецЕсли;
	
	Если ВыборкаПК.КонтрагентПК <> Контрагент Тогда
		Результат["error"] = "Компьютер не относится к выбранному контрагенту";
		Возврат Результат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВыборкаПК.IPУстройства) Тогда
		Результат["error"] = "У выбранного компьютера не заполнен IPУстройства";
		Возврат Результат;
	КонецЕсли;
	
	ЗапросПорт = Новый Запрос;
	ЗапросПорт.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Настройки.ПортMelezh КАК ПортMelezh
	|ИЗ
	|	РегистрСведений.АС_НастройкиПрограммы КАК Настройки
	|ГДЕ
	|	Настройки.Контрагент = &Контрагент";
	
	ЗапросПорт.УстановитьПараметр("Контрагент", Контрагент);
	ВыборкаПорт = ЗапросПорт.Выполнить().Выбрать();
	Если Не ВыборкаПорт.Следующий() Тогда
		Результат["error"] = "Не найден ПортMelezh в АС_НастройкиПрограммы";
		Возврат Результат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВыборкаПорт.ПортMelezh) Тогда
		Результат["error"] = "В регистре АС_НастройкиПрограммы не заполнен ПортMelezh";
		Возврат Результат;
	КонецЕсли;
	
	IP = СокрЛП(Строка(ВыборкаПК.IPУстройства));
	Порт = СокрЛП(Строка(ВыборкаПорт.ПортMelezh));
	
	Результат["ip"] = IP;
	Результат["port"] = Порт;
	Результат["baseUrl"] = "http://" + IP + ":" + Порт;
	Результат["ok"] = Истина;
	Возврат Результат;
КонецФункции

&НаСервере
Процедура ОчиститьТабличныеЧастиНаСервере()
	Объект.Диски.Очистить();
	Объект.Архивации.Очистить();
	Объект.ОСистеме.Очистить();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДискиНаСервере(ДанныеДисков, ДатаАктуальности = "")
	Объект.Диски.Очистить();
	ДанныеДисков = РаспаковатьПолезныеДанные(ДанныеДисков);
	КоллекцияДисков = ПолучитьКоллекцию(ДанныеДисков, "disks");
	
	Для Каждого Диск Из КоллекцияДисков Цикл
		Если ТипЗнч(Диск) <> Тип("Структура") И ТипЗнч(Диск) <> Тип("Соответствие") Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Объект.Диски.Добавить();
		НоваяСтрока.Диск = ЗначениеВСтроку(ПолучитьПервоеЗаполненное(Диск, МассивКлючей("name,model,id,device")));
		НоваяСтрока.Здоровье = ЛокализоватьЗдоровьеДиска(ПолучитьПервоеЗаполненное(Диск, МассивКлючей("health,status,healthStatus,state,condition")));
		ОбъемЗначение = ПолучитьПервоеЗаполненное(Диск, МассивКлючей("sizeTotalBytes,capacity,totalBytes,sizeBytes,size,volume,usage.total,usage.capacity,space.total,disk.capacity"));
		СвободноЗначение = ПолучитьПервоеЗаполненное(Диск, МассивКлючей("sizeFreeBytes,free,freeSpace,freeBytes,available,availableBytes,usage.free,space.free,disk.free"));
		ЗанятоЗначение = ПолучитьПервоеЗаполненное(Диск, МассивКлючей("sizeUsedBytes,used,usedSpace,usedBytes,occupied,usage.used,space.used,disk.used"));
		
		Если Не ЗначениеЗаполнено(ЗанятоЗначение) Тогда
			ОбъемЧисло = Неопределено;
			СвободноЧисло = Неопределено;
			Если ТипЗнч(ОбъемЗначение) = Тип("Число") Тогда
				ОбъемЧисло = ОбъемЗначение;
			КонецЕсли;
			Если ТипЗнч(СвободноЗначение) = Тип("Число") Тогда
				СвободноЧисло = СвободноЗначение;
			КонецЕсли;
			Если ОбъемЧисло <> Неопределено И СвободноЧисло <> Неопределено Тогда
				ЗанятоЗначение = ОбъемЧисло - СвободноЧисло;
			КонецЕсли;
		КонецЕсли;
		
		НоваяСтрока.Объем = ФорматироватьРазмерДиска(ОбъемЗначение);
		НоваяСтрока.Свободно = ФорматироватьРазмерДиска(СвободноЗначение);
		НоваяСтрока.Занято = ФорматироватьРазмерДиска(ЗанятоЗначение);
		НоваяСтрока.Температура = ЗначениеВСтроку(ПолучитьПервоеЗаполненное(Диск, МассивКлючей("temperatureCelsius,temperature")));
		Если ЗначениеЗаполнено(ДатаАктуальности) Тогда
			НоваяСтрока.ДатаПоследнегоОбновленияДиски = ФорматироватьДатуДляОтображения(ДатаАктуальности);
		Иначе
			НоваяСтрока.ДатаПоследнегоОбновленияДиски = ФорматироватьДатуДляОтображения(ПолучитьПервоеЗаполненное(Диск, МассивКлючей("updatedAt,timestampUtc,collectedAt")));
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАрхивацииНаСервере(ДанныеАрхиваций, ДанныеЛогов, ДатаАктуальности = "")
	Объект.Архивации.Очистить();
	ДанныеАрхиваций = РаспаковатьПолезныеДанные(ДанныеАрхиваций);
	ДанныеЛогов = РаспаковатьПолезныеДанные(ДанныеЛогов);
	КартаЗадач = ПостроитьКартуЗадачАрхивации(ДанныеАрхиваций);
	КоллекцияЛогов = ПолучитьКоллекцию(ДанныеЛогов, "recentLogs");
	Если КоллекцияЛогов.Количество() = 0 Тогда
		КоллекцияЛогов = ПолучитьКоллекцию(ДанныеЛогов, "logs");
	КонецЕсли;
	Если КоллекцияЛогов.Количество() = 0 Тогда
		КоллекцияЛогов = ПолучитьКоллекцию(ДанныеЛогов, "items");
	КонецЕсли;
	
	Для Каждого Лог Из КоллекцияЛогов Цикл
		Если ТипЗнч(Лог) <> Тип("Структура") И ТипЗнч(Лог) <> Тип("Соответствие") Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Объект.Архивации.Добавить();
		IDЗадачи = ЗначениеВСтроку(ПолучитьПервоеЗаполненное(Лог, МассивКлючей("jobId,taskId,backupId,id")));
		ИмяЗадачи = ЗначениеВСтроку(ПолучитьПервоеЗаполненное(Лог, МассивКлючей("jobName,taskName,name")));
		ИсточникПуть = ЗначениеВСтроку(ПолучитьПервоеЗаполненное(Лог, МассивКлючей("source,database,sourcePath")));
		НазначениеПуть = ЗначениеВСтроку(ПолучитьПервоеЗаполненное(Лог, МассивКлючей("destination,archivePath,targetPath")));
		КарточкаЗадачи = КартаЗадач.Получить(IDЗадачи);
		Если Не ЗначениеЗаполнено(ИмяЗадачи) И ЗначениеЗаполнено(IDЗадачи) И КарточкаЗадачи <> Неопределено Тогда
			ИмяЗадачи = ЗначениеВСтроку(КарточкаЗадачи.Получить("name"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ИсточникПуть) И ЗначениеЗаполнено(IDЗадачи) И КарточкаЗадачи <> Неопределено Тогда
			ИсточникПуть = ЗначениеВСтроку(КарточкаЗадачи.Получить("source"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(НазначениеПуть) И ЗначениеЗаполнено(IDЗадачи) И КарточкаЗадачи <> Неопределено Тогда
			НазначениеПуть = ЗначениеВСтроку(КарточкаЗадачи.Получить("destination"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ИмяЗадачи) И ЗначениеЗаполнено(IDЗадачи) Тогда
			ИмяЗадачи = IDЗадачи;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ИмяЗадачи) Тогда
			ИмяЗадачи = ИзвлечьИмяЗадачиИзСообщения(ЗначениеВСтроку(ПолучитьПервоеЗаполненное(Лог, МассивКлючей("message,details,description"))));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ИсточникПуть) Тогда
			ИсточникПуть = ИзвлечьПутьКБазеИзСообщения(ЗначениеВСтроку(ПолучитьПервоеЗаполненное(Лог, МассивКлючей("message,details,description"))));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(НазначениеПуть) Тогда
			НазначениеПуть = ИзвлечьПутьКАрхивуИзСообщения(ЗначениеВСтроку(ПолучитьПервоеЗаполненное(Лог, МассивКлючей("message,details,description"))));
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ИмяЗадачи) И ЗначениеЗаполнено(IDЗадачи) Тогда
			ИмяЗадачи = IDЗадачи;
		КонецЕсли;
		
		НоваяСтрока.Задача = ИмяЗадачи;
		СыройСтатус = ПолучитьПервоеЗаполненное(Лог, МассивКлючей("status,result,outcome,lastStatus"));
		Причина = ПолучитьПервоеЗаполненное(Лог, МассивКлючей("message,error,errorMessage,details,description"));
		НоваяСтрока.Статус = ЛокализоватьСтатусАрхивации(СыройСтатус, Причина);
		НоваяСтрока.ПутьКБазе = ИсточникПуть;
		НоваяСтрока.ПутьКАрхиву = НазначениеПуть;
		НоваяСтрока.ДатаВыполненияЗадачи = ФорматироватьДатуДляОтображения(ПолучитьПервоеЗаполненное(Лог, МассивКлючей("endTimeUtc,completedAt,finishedAt,endTime,startTimeUtc,startedAt,startTime,time")));
		Если ЗначениеЗаполнено(ДатаАктуальности) Тогда
			НоваяСтрока.ДатаПоследнегоОбновленияАрхивации = ФорматироватьДатуДляОтображения(ДатаАктуальности);
		Иначе
			НоваяСтрока.ДатаПоследнегоОбновленияАрхивации = ФорматироватьДатуДляОтображения(ПолучитьПервоеЗаполненное(Лог, МассивКлючей("timestampUtc,createdAt,updatedAt,time")));
		КонецЕсли;
	КонецЦикла;
	
	Если Объект.Архивации.Количество() = 0 Тогда
		КоллекцияАрхиваций = ПолучитьКоллекцию(ДанныеАрхиваций, "jobs");
		Для Каждого Задача Из КоллекцияАрхиваций Цикл
			Если ТипЗнч(Задача) <> Тип("Структура") И ТипЗнч(Задача) <> Тип("Соответствие") Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = Объект.Архивации.Добавить();
			НоваяСтрока.Задача = ЗначениеВСтроку(ПолучитьПервоеЗаполненное(Задача, МассивКлючей("name,jobName,id")));
			НоваяСтрока.Статус = ЛокализоватьСтатусАрхивации(ПолучитьПервоеЗаполненное(Задача, МассивКлючей("status,lastStatus")), "");
			НоваяСтрока.ПутьКБазе = ЗначениеВСтроку(ПолучитьПервоеЗаполненное(Задача, МассивКлючей("source,database")));
			НоваяСтрока.ПутьКАрхиву = ЗначениеВСтроку(ПолучитьПервоеЗаполненное(Задача, МассивКлючей("destination,archivePath")));
			НоваяСтрока.ДатаВыполненияЗадачи = ФорматироватьДатуДляОтображения(ПолучитьПервоеЗаполненное(Задача, МассивКлючей("endTimeUtc,completedAt,finishedAt,lastRunAt,startTimeUtc,startedAt")));
			Если ЗначениеЗаполнено(ДатаАктуальности) Тогда
				НоваяСтрока.ДатаПоследнегоОбновленияАрхивации = ФорматироватьДатуДляОтображения(ДатаАктуальности);
			Иначе
				НоваяСтрока.ДатаПоследнегоОбновленияАрхивации = ФорматироватьДатуДляОтображения(ПолучитьПервоеЗаполненное(Задача, МассивКлючей("lastRunAt,updatedAt,timestampUtc")));
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОСистемеНаСервере(ДанныеСистемы, IPИзСправочника = "", ДатаАктуальности = "")
	Объект.ОСистеме.Очистить();
	ДанныеСистемы = РаспаковатьПолезныеДанные(ДанныеСистемы);
	
	Если ДанныеСистемы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеСистемы) = Тип("Массив") И ДанныеСистемы.Количество() > 0 Тогда
		ДанныеСистемы = ДанныеСистемы[0];
	КонецЕсли;
	
	Если ТипЗнч(ДанныеСистемы) <> Тип("Структура") И ТипЗнч(ДанныеСистемы) <> Тип("Соответствие") Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаСистемы = Объект.ОСистеме.Добавить();
	СтрокаСистемы.HostName = ЗначениеВСтроку(ПолучитьПервоеЗаполненное(ДанныеСистемы, МассивКлючей("hostName,hostname")));
	Если ЗначениеЗаполнено(IPИзСправочника) Тогда
		СтрокаСистемы.IPАдреса = ЗначениеВСтроку(IPИзСправочника);
	Иначе
		СтрокаСистемы.IPАдреса = ЗначениеВСтроку(СформироватьСтрокуИзКоллекции(ПолучитьЗначениеПоКлючу(ДанныеСистемы, "networkAddresses")));
	КонецЕсли;
	
	ОСИсточник = ЗначениеВСтроку(ПолучитьПервоеЗаполненное(ДанныеСистемы, МассивКлючей("operatingSystem,osCaption,osVersion,os,platform,caption,version")));
	СтрокаСистемы.ОперационнаяСистема = НормализоватьВерсиюОС(ОСИсточник);
	СтрокаСистемы.Процессор = ЗначениеВСтроку(ПолучитьПервоеЗаполненное(ДанныеСистемы, МассивКлючей("processor,processorName,cpu,cpuModel,cpuName")));
	СтрокаСистемы.Видеокарта = ЗначениеВСтроку(СформироватьСтрокуИзКоллекции(ПолучитьЗначениеПоКлючу(ДанныеСистемы, "videoControllers")));
	ОЗУВсего = ПолучитьПервоеЗаполненное(ДанныеСистемы, МассивКлючей("totalRamBytes,memoryTotal,totalMemory,ram,installedMemory,memory"));
	ОЗУДоступно = ПолучитьПервоеЗаполненное(ДанныеСистемы, МассивКлючей("availableRamBytes,freeRamBytes,memoryAvailable"));
	СтрокаСистемы.ОЗУ = СформироватьСтрокуОЗУ(ОЗУВсего, ОЗУДоступно);
	Если ЗначениеЗаполнено(ДатаАктуальности) Тогда
		СтрокаСистемы.ДатаПоследнегоОбновленияСистемы = ФорматироватьДатуДляОтображения(ДатаАктуальности);
	Иначе
		СтрокаСистемы.ДатаПоследнегоОбновленияСистемы = ФорматироватьДатуДляОтображения(ПолучитьПервоеЗаполненное(ДанныеСистемы, МассивКлючей("collectedAt,timestampUtc,updatedAt")));
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьКоллекцию(Данные, КлючКоллекции = "")
	Источник = РаспаковатьПолезныеДанные(Данные);
	Если ЗначениеЗаполнено(КлючКоллекции) Тогда
		ИзвлеченноеЗначение = ПолучитьЗначениеПоКлючу(Данные, КлючКоллекции);
		Если ИзвлеченноеЗначение = Неопределено Тогда
			ИзвлеченноеЗначение = ПолучитьЗначениеПоКлючу(Источник, КлючКоллекции);
		КонецЕсли;
		Если ИзвлеченноеЗначение <> Неопределено Тогда
			Источник = РаспаковатьПолезныеДанные(ИзвлеченноеЗначение);
		КонецЕсли;
	КонецЕсли;
	
	Если Источник = Неопределено Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("Строка") Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("Массив") Тогда
		Возврат Источник;
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("ФиксированныйМассив") Тогда
		Результат = Новый Массив;
		Для Каждого ЭлементИсточник Из Источник Цикл
			Результат.Добавить(ЭлементИсточник);
		КонецЦикла;
		Возврат Результат;
	КонецЕсли;
	
	Результат = Новый Массив;
	Результат.Добавить(Источник);
	Возврат Результат;
КонецФункции

&НаСервере
Функция РаспаковатьПолезныеДанные(Данные)
	ТекущиеДанные = Данные;
	
	Для НомерШага = 1 По 4 Цикл
		Если ТипЗнч(ТекущиеДанные) <> Тип("Структура") И ТипЗнч(ТекущиеДанные) <> Тип("Соответствие") Тогда
			Возврат ТекущиеДанные;
		КонецЕсли;
		
		СледующиеДанные = Неопределено;
		Для Каждого Ключ Из МассивКлючей("data,result,payload,response,body,value,item,items") Цикл
			СледующиеДанные = ПолучитьЗначениеПоКлючу(ТекущиеДанные, Ключ);
			Если СледующиеДанные <> Неопределено Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если СледующиеДанные = Неопределено Тогда
			Возврат ТекущиеДанные;
		КонецЕсли;
		
		ТекущиеДанные = СледующиеДанные;
	КонецЦикла;
	
	Возврат ТекущиеДанные;
КонецФункции

&НаСервере
Функция ПолучитьПервоеЗаполненное(Источник, Ключи)
	Для Каждого Ключ Из Ключи Цикл
		ЗначениеПоля = ПолучитьЗначениеПоКлючу(Источник, Ключ);
		Если ЗначениеПоля <> Неопределено И ЗначениеЗаполнено(ЗначениеПоля) Тогда
			Возврат ЗначениеПоля;
		КонецЕсли;
	КонецЦикла;
	
	Возврат "";
КонецФункции

&НаСервере
Функция ПолучитьЗначениеПоКлючу(Источник, Ключ)
	Если Источник = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если СтрНайти(Ключ, ".") > 0 Тогда
		ЗначениеПоПути = ПолучитьЗначениеПоПути(Источник, Ключ);
		Если ЗначениеПоПути <> Неопределено Тогда
			Возврат ЗначениеПоПути;
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("Соответствие") Тогда
		Возврат Источник.Получить(Ключ);
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("Структура") Тогда
		ЗначениеПоля = Неопределено;
		Если Источник.Свойство(Ключ, ЗначениеПоля) Тогда
			Возврат ЗначениеПоля;
		КонецЕсли;
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

&НаСервере
Функция СформироватьСтрокуИзКоллекции(Коллекция)
	Если Коллекция = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	Если ТипЗнч(Коллекция) = Тип("Строка") Тогда
		Возврат Коллекция;
	КонецЕсли;
	
	Если ТипЗнч(Коллекция) = Тип("Массив") ИЛИ ТипЗнч(Коллекция) = Тип("ФиксированныйМассив") Тогда
		МассивСтрок = Новый Массив;
		Для Каждого ЭлементКоллекции Из Коллекция Цикл
			Если ТипЗнч(ЭлементКоллекции) = Тип("Соответствие") Тогда
				МассивСтрок.Добавить(ЗначениеВСтроку(ПолучитьПервоеЗаполненное(ЭлементКоллекции, МассивКлючей("address,name,value"))));
			Иначе
				МассивСтрок.Добавить(ЗначениеВСтроку(ЭлементКоллекции));
			КонецЕсли;
		КонецЦикла;
		Возврат СтрСоединить(МассивСтрок, ", ");
	КонецЕсли;
	
	Возврат ЗначениеВСтроку(Коллекция);
КонецФункции

&НаСервере
Функция ЗначениеВСтроку(Значение)
	Если Значение = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	Если ТипЗнч(Значение) = Тип("Булево") Тогда
		Если Значение Тогда
			Возврат "Истина";
		Иначе
			Возврат "Ложь";
		КонецЕсли;
	КонецЕсли;
	
	Возврат Строка(Значение);
КонецФункции

&НаСервере
Функция МассивКлючей(СтрокаКлючей)
	Результат = Новый Массив;
	Если Не ЗначениеЗаполнено(СтрокаКлючей) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Для Каждого Ключ Из СтрРазделить(СтрокаКлючей, ",") Цикл
		Результат.Добавить(СокрЛП(Ключ));
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

&НаСервере
Функция ВыполнитьGETMelezh(URL)
	ОтветЗапроса = Новый Соответствие;
	ОтветЗапроса.Вставить("ok", Ложь);
	ОтветЗапроса.Вставить("url", URL);
	ОтветЗапроса.Вставить("data", Неопределено);
	ОтветЗапроса.Вставить("error", "");
	
	Попытка
		СырыеДанные = OPI_ЗапросыHTTP.Get(URL);
		ОтветЗапроса["data"] = НормализоватьДанныеMelezh(СырыеДанные);
		ОтветЗапроса["ok"] = Истина;
	Исключение
		ОтветЗапроса["error"] = ОписаниеОшибки();
	КонецПопытки;
	
	Возврат ОтветЗапроса;
КонецФункции

&НаСервере
Функция НормализоватьДанныеMelezh(СырыеДанные)
	Если СырыеДанные = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(СырыеДанные) = Тип("Строка") Тогда
		Разобранные = ПопыткаРазобратьJSONСтроку(СырыеДанные);
		Если Разобранные <> Неопределено Тогда
			Возврат Разобранные;
		КонецЕсли;
		Возврат СырыеДанные;
	КонецЕсли;
	
	Если ТипЗнч(СырыеДанные) = Тип("Соответствие") Тогда
		Тело = СырыеДанные.Получить("body");
		Если Тело = Неопределено Тогда
			Тело = СырыеДанные.Получить("Body");
		КонецЕсли;
		Если ТипЗнч(Тело) = Тип("Строка") Тогда
			Разобранные = ПопыткаРазобратьJSONСтроку(Тело);
			Если Разобранные <> Неопределено Тогда
				Возврат Разобранные;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(СырыеДанные) = Тип("Структура") Тогда
		Тело = Неопределено;
		Если СырыеДанные.Свойство("body", Тело) И ТипЗнч(Тело) = Тип("Строка") Тогда
			Разобранные = ПопыткаРазобратьJSONСтроку(Тело);
			Если Разобранные <> Неопределено Тогда
				Возврат Разобранные;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат СырыеДанные;
КонецФункции

&НаСервере
Функция ПопыткаРазобратьJSONСтроку(ТекстJSON)
	Если Не ЗначениеЗаполнено(ТекстJSON) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТекстJSON = СокрЛП(ТекстJSON);
	Если СтрДлина(ТекстJSON) = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПервыйСимвол = Лев(ТекстJSON, 1);
	Если ПервыйСимвол <> "{" И ПервыйСимвол <> "[" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		Возврат OPI_Инструменты.JsonВСтруктуру(ТекстJSON);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
КонецФункции

&НаСервере
Функция ПолучитьДатуАктуальностиИзСтатуса(ДанныеСтатуса)
	ДанныеСтатуса = РаспаковатьПолезныеДанные(ДанныеСтатуса);
	ДатаСтатуса = ЗначениеВСтроку(ПолучитьПервоеЗаполненное(ДанныеСтатуса, МассивКлючей("timestampUtc,timestamp,updatedAt,lastUpdated,collectedAt,time")));
	Возврат ФорматироватьДатуДляОтображения(ДатаСтатуса);
КонецФункции

&НаСервере
Функция ФорматироватьДатуДляОтображения(ЗначениеДаты)
	Если ЗначениеДаты = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	Если ТипЗнч(ЗначениеДаты) = Тип("Дата") Тогда
		Возврат Формат(ЗначениеДаты, "ДФ='dd.MM.yyyy'");
	КонецЕсли;
	
	ТекстДаты = СокрЛП(ЗначениеВСтроку(ЗначениеДаты));
	Если Не ЗначениеЗаполнено(ТекстДаты) Тогда
		Возврат "";
	КонецЕсли;
	
	Если СтрДлина(ТекстДаты) >= 10 Тогда
		Если Сред(ТекстДаты, 5, 1) = "-" И Сред(ТекстДаты, 8, 1) = "-" Тогда
			Год = Лев(ТекстДаты, 4);
			Месяц = Сред(ТекстДаты, 6, 2);
			День = Сред(ТекстДаты, 9, 2);
			Возврат День + "." + Месяц + "." + Год;
		КонецЕсли;
		
		Если Сред(ТекстДаты, 3, 1) = "." И Сред(ТекстДаты, 6, 1) = "." Тогда
			Возврат Лев(ТекстДаты, 10);
		КонецЕсли;
	КонецЕсли;
	
	Попытка
		ДатаЗначение = Дата(ТекстДаты);
		Возврат Формат(ДатаЗначение, "ДФ='dd.MM.yyyy'");
	Исключение
		Если СтрДлина(ТекстДаты) >= 10 Тогда
			Возврат Лев(ТекстДаты, 10);
		КонецЕсли;
		Возврат ТекстДаты;
	КонецПопытки;
КонецФункции

&НаСервере
Функция ЛокализоватьЗдоровьеДиска(СыройСтатус)
	Статус = НРег(СокрЛП(ЗначениеВСтроку(СыройСтатус)));
	Если Статус = "" Тогда
		Возврат "";
	КонецЕсли;
	
	Если Статус = "critical" ИЛИ Статус = "failed" ИЛИ Статус = "bad" Тогда
		Возврат "Критическое";
	КонецЕсли;
	
	Если Статус = "ok" ИЛИ Статус = "good" ИЛИ Статус = "healthy" Тогда
		Возврат "Хорошее";
	КонецЕсли;
	
	Если Статус = "warning" ИЛИ Статус = "acceptable" ИЛИ Статус = "fair" Тогда
		Возврат "Приемлемо";
	КонецЕсли;
	
	Возврат ЗначениеВСтроку(СыройСтатус);
КонецФункции

&НаСервере
Функция ЛокализоватьСтатусАрхивации(СыройСтатус, Причина)
	Статус = НРег(СокрЛП(ЗначениеВСтроку(СыройСтатус)));
	ТекстПричины = СокрЛП(ЗначениеВСтроку(Причина));
	
	Если Статус = "ok" ИЛИ Статус = "success" ИЛИ Статус = "succeeded" ИЛИ Статус = "done" Тогда
		Локализованный = "Успешно";
	ИначеЕсли Статус = "error" ИЛИ Статус = "failed" ИЛИ Статус = "failure" ИЛИ Статус = "critical" Тогда
		Локализованный = "Ошибка";
	Иначе
		Локализованный = ЗначениеВСтроку(СыройСтатус);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстПричины) Тогда
		Если ЗначениеЗаполнено(Локализованный) Тогда
			Возврат Локализованный + ": " + ТекстПричины;
		Иначе
			Возврат ТекстПричины;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Локализованный;
КонецФункции

&НаСервере
Функция НормализоватьВерсиюОС(СыраяОС)
	ТекстОС = СокрЛП(ЗначениеВСтроку(СыраяОС));
	НижнийТекстОС = НРег(ТекстОС);
	
	Если НижнийТекстОС = "" Тогда
		Возврат "";
	КонецЕсли;
	
	Если СтрНайти(НижнийТекстОС, "windows") > 0 Тогда
		Если СтрНайти(НижнийТекстОС, "11") > 0 ИЛИ СтрНайти(НижнийТекстОС, "10.0.22") > 0 Тогда
			Возврат "Windows 11";
		КонецЕсли;
		Если СтрНайти(НижнийТекстОС, "10") > 0 Тогда
			Возврат "Windows 10";
		КонецЕсли;
	КонецЕсли;
	
	Если Лев(ТекстОС, 7) = "10.0.22" Тогда
		Возврат "Windows 11";
	КонецЕсли;
	
	Если Лев(ТекстОС, 5) = "10.0." Тогда
		Возврат "Windows 10";
	КонецЕсли;
	
	Возврат ТекстОС;
КонецФункции

&НаСервере
Функция ПолучитьЗначениеПоПути(Источник, ПутьКЗначению)
	ТекущееЗначение = Источник;
	Для Каждого ИмяСегмента Из СтрРазделить(ПутьКЗначению, ".") Цикл
		Если ТекущееЗначение = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		ИмяСегмента = СокрЛП(ИмяСегмента);
		Если ТипЗнч(ТекущееЗначение) = Тип("Соответствие") Тогда
			ТекущееЗначение = ТекущееЗначение.Получить(ИмяСегмента);
		ИначеЕсли ТипЗнч(ТекущееЗначение) = Тип("Структура") Тогда
			Промежуточное = Неопределено;
			Если ТекущееЗначение.Свойство(ИмяСегмента, Промежуточное) Тогда
				ТекущееЗначение = Промежуточное;
			Иначе
				Возврат Неопределено;
			КонецЕсли;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТекущееЗначение;
КонецФункции

&НаСервере
Функция ПостроитьКартуЗадачАрхивации(ДанныеАрхиваций)
	Карта = Новый Соответствие;
	КоллекцияАрхиваций = ПолучитьКоллекцию(ДанныеАрхиваций, "jobs");
	
	Для Каждого Задача Из КоллекцияАрхиваций Цикл
		Если ТипЗнч(Задача) <> Тип("Структура") И ТипЗнч(Задача) <> Тип("Соответствие") Тогда
			Продолжить;
		КонецЕсли;
		
		IDЗадачи = ЗначениеВСтроку(ПолучитьПервоеЗаполненное(Задача, МассивКлючей("id,jobId,taskId")));
		Если Не ЗначениеЗаполнено(IDЗадачи) Тогда
			Продолжить;
		КонецЕсли;
		
		Карточка = Новый Соответствие;
		Карточка.Вставить("name", ПолучитьПервоеЗаполненное(Задача, МассивКлючей("name,jobName,taskName")));
		Карточка.Вставить("source", ПолучитьПервоеЗаполненное(Задача, МассивКлючей("source,database,sourcePath")));
		Карточка.Вставить("destination", ПолучитьПервоеЗаполненное(Задача, МассивКлючей("destination,archivePath,targetPath")));
		Карта.Вставить(IDЗадачи, Карточка);
	КонецЦикла;
	
	Возврат Карта;
КонецФункции

&НаСервере
Функция СформироватьСтрокуОЗУ(ОЗУВсего, ОЗУДоступно)
	ВсегоЧисло = ПолучитьЧислоИзЗначения(ОЗУВсего);
	ДоступноЧисло = ПолучитьЧислоИзЗначения(ОЗУДоступно);
	
	Если ВсегоЧисло = Неопределено Тогда
		Возврат ЗначениеВСтроку(ОЗУВсего);
	КонецЕсли;
	
	ВсегоГБ = Окр(ВсегоЧисло / 1073741824, 2);
	Если ДоступноЧисло = Неопределено Тогда
		Возврат Строка(ВсегоГБ) + " ГБ";
	КонецЕсли;
	
	ДоступноГБ = Окр(ДоступноЧисло / 1073741824, 2);
	Возврат Строка(ВсегоГБ) + " ГБ (доступно: " + Строка(ДоступноГБ) + " ГБ)";
КонецФункции

&НаСервере
Функция ФорматироватьРазмерДиска(Значение)
	РазмерГБ = ПолучитьРазмерВГБИзЗначения(Значение);
	Если РазмерГБ = Неопределено Тогда
		Возврат ЗначениеВСтроку(Значение);
	КонецЕсли;
	
	Если РазмерГБ >= 1000 Тогда
		РазмерТБ = Окр(РазмерГБ / 1024, 2);
		Возврат Строка(РазмерТБ) + " ТБ";
	КонецЕсли;
	
	Возврат Строка(Окр(РазмерГБ, 2)) + " ГБ";
КонецФункции

&НаСервере
Функция ПолучитьРазмерВГБИзЗначения(Значение)
	РазмерЧислом = ПолучитьЧислоИзЗначения(Значение);
	Если РазмерЧислом = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если РазмерЧислом > 1048576 Тогда
		Возврат РазмерЧислом / 1073741824;
	КонецЕсли;
	
	Если РазмерЧислом > 1024 Тогда
		Возврат РазмерЧислом / 1024;
	КонецЕсли;
	
	Возврат РазмерЧислом;
КонецФункции

&НаСервере
Функция ПолучитьЧислоИзЗначения(Значение)
	Если Значение = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(Значение) = Тип("Число") Тогда
		Возврат Значение;
	КонецЕсли;
	
	Текст = СокрЛП(Строка(Значение));
	Если Не ЗначениеЗаполнено(Текст) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		Возврат Число(Текст);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
КонецФункции

&НаСервере
Функция ИзвлечьПутьКАрхивуИзСообщения(Сообщение)
	Текст = СокрЛП(Сообщение);
	ПозицияДвоеточия = СтрНайти(Текст, ":");
	Если ПозицияДвоеточия > 0 Тогда
		ЧастьПосле = СокрЛП(Сред(Текст, ПозицияДвоеточия + 1));
		Если СтрНайти(НРег(ЧастьПосле), ".rar") > 0 ИЛИ СтрНайти(НРег(ЧастьПосле), ".zip") > 0 Тогда
			Возврат ЧастьПосле;
		КонецЕсли;
	КонецЕсли;
	Возврат "";
КонецФункции

&НаСервере
Функция ИзвлечьПутьКБазеИзСообщения(Сообщение)
	Текст = СокрЛП(Сообщение);
	Если СтрНайти(НРег(Текст), "mssql") > 0 Тогда
		Возврат "MSSQL";
	КонецЕсли;
	Если СтрНайти(НРег(Текст), "файловая") > 0 Тогда
		Возврат "Файловая база";
	КонецЕсли;
	Возврат "";
КонецФункции

&НаСервере
Функция ИзвлечьИмяЗадачиИзСообщения(Сообщение)
	Текст = НРег(СокрЛП(Сообщение));
	Если СтрНайти(Текст, "mssql") > 0 Тогда
		Возврат "MSSQL-архивация";
	КонецЕсли;
	Если СтрНайти(Текст, "файловая") > 0 Тогда
		Возврат "Файловая архивация";
	КонецЕсли;
	Возврат "";
КонецФункции

//- BAS 24.05.2026 : Melezh мониторинг, статусы и заполнение ТЧ
